In [1]:
import numpy as np
import pandas as pd
bank_data_path = "data/banking_data"

In [2]:
df_trx = pd.read_csv(f"{bank_data_path}/completedtrans.csv", low_memory=False)
df_trx.shape

(1056320, 16)

In [3]:
accounts = df_trx["account_id"].unique()
for acct in accounts:
    df_group = df_trx[df_trx["account_id"]==acct].copy()
    break

df_group

,Unnamed: 0,trans_id,account_id,type,operation,amount,balance,k_symbol,bank,account,year,month,day,fulldate,fulltime,fulldatewithtime
0,1,T00695247,A00002378,Credit,Credit in Cash,700.0,700.0,NaN,NaN,NaN,2013,1,1,2013-01-01,11:02:40,2013-01-01T11:02:40
95,96,T00695250,A00002378,Credit,Credit in Cash,7268.0,7968.0,NaN,NaN,NaN,2013,1,22,2013-01-22,14:43:54,2013-01-22T14:43:54
100,101,T00695266,A00002378,Credit,Credit in Cash,14440.0,22408.0,NaN,NaN,NaN,2013,1,23,2013-01-23,13:56:58,2013-01-23T13:56:58
104,105,T00695262,A00002378,Credit,Credit in Cash,49752.0,72160.0,NaN,NaN,NaN,2013,1,24,2013-01-24,08:37:03,2013-01-24T08:37:03
113,114,T00695265,A00002378,Credit,Credit in Cash,21899.0,94059.0,NaN,NaN,NaN,2013,1,26,2013-01-26,09:50:04,2013-01-26T09:50:04
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1032771,1032772,T00695647,A00002378,Credit,Credit in Cash,1900.0,39664.4,NaN,NaN,NaN,2018,12,1,2018-12-01,09:06:42,2018-12-01T09:06:42
1036812,1036813,T00695410,A00002378,Debit,Remittance to Another Bank,9612.0,30052.4,Household,Citigroup,1222903.0,2018,12,7,2018-12-07,08:13:06,2018-12-07T08:13:06
1049182,1049183,T00695335,A00002378,Credit,Credit in Cash,45410.0,93133.4,NaN,NaN,NaN,2018,12,21,2018-12-21,10:10:52,2018-12-21T10:10:52
1049183,1049184,T00695328,A00002378,Credit,Credit in Cash,17671.0,47723.4,NaN,NaN,NaN,2018,12,21,2018-12-21,16:14:26,2018-12-21T16:14:26
1055280,1055281,T03608663,A00002378,Credit,NaN,216.2,93349.5,Interest Credited,NaN,NaN,2018,12,31,2018-12-31,11:31:33,2018-12-31T11:31:33

In [4]:
len(accounts)

4500

In [5]:
df_event = pd.read_csv(f"{bank_data_path}/CRM Events.csv", low_memory=False)
df_event["Company response to consumer"].apply(lambda x: "Closed" if "Closed" in x else "Open")

Company response to consumer
Closed with explanation            14337
Closed with monetary relief         5267
Closed with non-monetary relief     1934
Closed with relief                   759
Closed without relief                672
Closed                               266
In progress                          152
Untimely response                     32
Name: count, dtype: int64

In [6]:
df_join = pd.read_csv(f"{bank_data_path}/completeddisposition.csv")
df_join[df_join["client_id"]=="C00003141"]

        disp_id  client_id account_id   type
2976  D00003141  C00003141  A00002603  Owner

In [7]:
df_trx[df_trx["account_id"]=="A00002603"]

,Unnamed: 0,trans_id,account_id,type,operation,amount,balance,k_symbol,bank,account,year,month,day,fulldate,fulltime,fulldatewithtime
335497,335498,T00762425,A00002603,Credit,Credit in Cash,300.0,300.0,NaN,NaN,NaN,2016,6,14,2016-06-14,09:11:60,2016-06-14T09:11:60
346202,346203,T00762432,A00002603,Credit,Collection from Another Bank,5416.0,5716.0,Old Age Pension,Goldman Sachs,27247029.0,2016,7,7,2016-07-07,10:36:14,2016-07-07T10:36:14
361890,361891,T00762433,A00002603,Credit,Collection from Another Bank,5416.0,11132.0,Old Age Pension,Goldman Sachs,27247029.0,2016,8,7,2016-08-07,12:09:48,2016-08-07T12:09:48
378285,378286,T00762434,A00002603,Credit,Collection from Another Bank,5416.0,16548.0,Old Age Pension,Goldman Sachs,27247029.0,2016,9,7,2016-09-07,14:04:60,2016-09-07T14:04:60
395248,395249,T00762435,A00002603,Credit,Collection from Another Bank,5416.0,21964.0,Old Age Pension,Goldman Sachs,27247029.0,2016,10,7,2016-10-07,08:00:32,2016-10-07T08:00:32
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1032917,1032918,T00762578,A00002603,Debit,Cash Withdrawal,2400.0,29198.5,NaN,NaN,NaN,2018,12,1,2018-12-01,13:17:07,2018-12-01T13:17:07
1034746,1034747,T00762506,A00002603,Debit,Cash Withdrawal,500.0,28698.5,NaN,NaN,NaN,2018,12,5,2018-12-05,16:28:20,2018-12-05T16:28:20
1037341,1037342,T00762461,A00002603,Credit,Collection from Another Bank,5416.0,34114.5,Old Age Pension,Goldman Sachs,27247029.0,2018,12,7,2018-12-07,12:47:45,2018-12-07T12:47:45
1038573,1038574,T00762497,A00002603,Debit,Remittance to Another Bank,3210.0,30904.5,Household,Capital One,30168819.0,2018,12,8,2018-12-08,10:11:31,2018-12-08T10:11:31
1053807,1053808,T03616535,A00002603,Credit,NaN,128.5,31033.0,Interest Credited,NaN,NaN,2018,12,31,2018-12-31,12:41:15,2018-12-31T12:41:15

In [8]:
df_trx["operation"].value_counts()

operation
Cash Withdrawal                 434918
Remittance to Another Bank      208283
Credit in Cash                  156743
Collection from Another Bank     65226
Credit Card Withdrawal            8036
Name: count, dtype: int64